arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/inc/fsl_flash_driver_c90tfs.h
/*! @}*/ /* End of addtogroup c90tfs_flash_driver */


#if (FSL_FEATURE_FLASH_IS_FTFE == 1)
    #define DFLASH_IFR_READRESOURCE_ADDRESS                0x8003F8U
#else /* FSL_FEATURE_FLASH_IS_FTFL == 1 or FSL_FEATURE_FLASH_IS_FTFA = =1 */
    #define DFLASH_IFR_READRESOURCE_ADDRESS                0x8000FCU
#endif

#define GET_BIT_0_7(value)              ((uint8_t)(((uint32_t)(value)) & 0xFFU))
#define GET_BIT_8_15(value)             ((uint8_t)((((uint32_t)(value))>>8) & 0xFFU))
#define GET_BIT_16_23(value)            ((uint8_t)((((uint32_t)(value))>>16) & 0xFFU))
#define GET_BIT_24_31(value)            ((uint8_t)(((uint32_t)(value))>>24))

/* Flash security status */
#define FLASH_SECURITY_STATE_KEYEN         0x80U
#define FLASH_SECURITY_STATE_UNSECURED     0x02U

/*!
 * @addtogroup c90tfs_flash_driver
 * @{
 */

/*------------ Return Code Definition for FTFx SSD ---------------------*/
/*! @brief Return Code Definition for FTFx SSD */
typedef enum flash_drv_status
{
    FTFx_OK             = 0x0000U, /*!< Function executes successfully */
    FTFx_ERR_MGSTAT0    = 0x0001U, /*!< MGSTAT0 error */
    FTFx_ERR_PVIOL      = 0x0010U, /*!< Protection violation */
    FTFx_ERR_ACCERR     = 0x0020U, /*!< Flash Access error */
    FTFx_ERR_RDCOLERR   = 0x0040U, /*!< Read Collision Error */
    FTFx_ERR_CHANGEPROT = 0x0100U, /*!< Cannot change protection status */
    FTFx_ERR_NOEEE      = 0x0200U, /*!< FlexRAM is not set for EEPROM use */
    FTFx_ERR_EFLASHONLY = 0x0400U, /*!< FlexNVM is set for full EEPROM backup */
    FTFx_ERR_RAMRDY     = 0x0800U, /*!< Programming acceleration RAM is not available */
    FTFx_ERR_RANGE      = 0x1000U, /*!< Address is out of the valid range */
    FTFx_ERR_SIZE       = 0x2000U  /*!< Misaligned size */
}flash_drv_status_t;


/*!
 * @name Flash security status
 * @{
 */
/*! @brief  Flash currently not in secure state */
#define FLASH_NOT_SECURE                   0x01U
/*! @brief  Flash is secured and backdoor key access enabled */
#define FLASH_SECURE_BACKDOOR_ENABLED      0x02U
/*! @brief  Flash is secured and backdoor key access disabled */
#define FLASH_SECURE_BACKDOOR_DISABLED     0x04U
/*@}*/


/*--------------------- CallBack function period -----------------------*/
#ifndef FLASH_CALLBACK_CS
/*! @brief  Callback period coint for FlashCheckSum */
#define FLASH_CALLBACK_CS               0x0AU
#endif

/*--------------------Null Callback function definition ----------------*/
/*!
 * @name Null Callback function definition
 * @{
 */
/*! @brief  Null callback */
#define NULL_CALLBACK                   ((PCALLBACK)0xFFFFFFFFU)
/*! @brief  Null swap callback */
#define NULL_SWAP_CALLBACK              ((PFLASH_SWAP_CALLBACK)0xFFFFFFFFU)
/*@}*/

/*-------------------- Callback function prototype ---------------------*/
/*! @brief Call back function pointer data type */
typedef void (* PCALLBACK)(void);
/*! @brief Swap call back function pointer data type */
typedef bool (* PFLASH_SWAP_CALLBACK)(uint8_t function);


/*---------------- Flash SSD Configuration Structure -------------------*/
/*! @brief Flash User Config Structure
*/
typedef struct _flash_user_config
{
    uint32_t      PFlashBase;         /*!< The base address of P-Flash memory */
    uint32_t      PFlashSize;         /*!< The size in byte of P-Flash memory */
    uint32_t      DFlashBase;         /*!< For FlexNVM device, this is the base address of D-Flash memory (FlexNVM memory); For non-FlexNVM device, this field is unused */
    uint32_t      EERAMBase;          /*!< The base address of  FlexRAM  (for FlexNVM
                                              device) or acceleration RAM  memory  (for non-FlexNVM device) */
    PCALLBACK     CallBack;          /*!< Call back function to service the time critical events */
} FLASH_USER_CONFIG,*PFLASH_USER_CONFIG;
/*! @brief Flash SSD Configuration Structure
*
* The structure includes the static parameters for  C90TFS/FTFx  which are
* device-dependent. The fields including
* PFlashBlockBase, PFlashBlockSize, DFlashBlockBase, EERAMBlockBase,
* and CallBack are passed via FLASH_USER_CONFIG.
* The rest of parameters such as DFlashBlockSize, and EEEBlockSize will be
* initialized in FlashInit() automatically.
*/
typedef struct _ssd_config
{
    uint32_t      PFlashBase;         /*!< The base address of P-Flash memory */
    uint32_t      PFlashSize;         /*!< The size in byte of P-Flash memory */
    uint32_t      DFlashBase;         /*!< For FlexNVM device, this is the base address of D-Flash memory (FlexNVM memory); For non-FlexNVM device, this field is unused */
    uint32_t      DFlashSize;         /*!< For FlexNVM device, this is the size in byte of area
                                          which is used as  D-Flash  from FlexNVM
                                          memory;  For non-FlexNVM device, this field is unused */
    uint32_t      EERAMBase;          /*!< The base address of  FlexRAM  (for FlexNVM
                                          device) or acceleration RAM  memory  (for non-FlexNVM device) */
    uint32_t      EEESize;            /*!< For FlexNVM device, this is the size in byte of
                                          EEPROM area  which was partitioned from
                                          FlexRAM; For non-FlexNVM device, this field is unused */
    PCALLBACK     CallBack;          /*!< Call back function to service the time critical events */
} FLASH_SSD_CONFIG,*PFLASH_SSD_CONFIG;

/* -------------------- Function Pointer ------------------------------- */
/*! @brief FlashCommandSequence function pointer */
typedef flash_drv_status_t (*pFLASHCOMMANDSEQUENCE) (const PFLASH_SSD_CONFIG pSSDConfig);

/*---------------- Function Prototypes for Flash SSD --------------------*/

/*!
 * @name C90TFS Flash driver APIs
 * @{
 */
#if defined(__cplusplus)
extern "C" {
#endif
/*!
 * @brief Relocates a function to RAM address.
 *
 * This function provides a facility to relocate a function in RAM.
 *
 * @param dest:    Destination address where you want to place the function.
 * @param size:    Size of the function
 * @param src:     Address of the function will be relocated
 * @return Relocated address of the function .
 */
uint32_t RelocateFunction(uint32_t dest, uint32_t size, uint32_t src);

/*!
 * @brief Initializes Flash.
 *
 * This API  initializes  Flash  module by clearing status error
 * bit and reporting the memory configuration via SSD configuration structure.
 *
 * @param pUserConf:    The user configuration structure pointer.
 * @param pSSDConfig:    The SSD configuration structure pointer.
 * @param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * @return Successful completion (FTFx_OK)
 */
flash_drv_status_t FlashInit(const PFLASH_USER_CONFIG pUserConf, PFLASH_SSD_CONFIG pSSDConfig, pFLASHCOMMANDSEQUENCE pFlashCommandSequence);

/*!
 * @brief Flash command sequence.
 *
 * This API is used to perform command write sequence on  Flash.
 * It is internal function, called by driver APIs only.
 *
 * @param pSSDConfig:    The SSD configuration structure pointer.
 * @return Successful completion (FTFx_OK)
 * @return Failed in Flash command execution (FTFx_ERR_ACCERR, FTFx_ERR_PVIOL,
 * FTFx_ERR_MGSTAT0)
 */
flash_drv_status_t FlashCommandSequence(const PFLASH_SSD_CONFIG pSSDConfig);

/*!
 * @brief P-Flash get protection.
 *
 * This  API  retrieves  the current  P-Flash  protection  status.  Considering
 * the  time  consumption  for getting protection is very  low and even can
 * be  ignored. It is not necessary to utilize the Callback function to
 * support the time-critical events.
 *
 * @param protectStatus: To return the current value of the P-Flash Protection.
 *                       Each bit is corresponding
 *                       to protection of 1/32 of the total P-Flash. The least
 *                       significant bit is corresponding to the lowest
 *                       address area of P-Flash. The most significant bit
 *                       is corresponding to the highest address area of P-
 *                       Flash and so on. There are two possible cases as below:
 *                       -  0: this area is protected.
 *                       -  1: this area is unprotected.
 * @return
 */
void PFlashGetProtection(uint32_t*  protectStatus);

/*!
 * @brief P-Flash set protection.
 *
 * This API sets the P-Flash protection to the intended protection status.
 * Setting P-Flash protection status is subject to a protection transition
 * restriction. If there is a setting violation, it  returns
 * an error code and the current protection status won’t be changed.
 *
 * @param protectStatus: The expected protect status user wants to set to
 *                       P-Flash protection register. Each bit is corresponding
 *                       to protection of 1/32 of the total P-Flash. The least
 *                       significant bit is corresponding to the lowest
 *                       address area of P-Flash. The most significant bit
 *                       is corresponding to the highest address area of P-
 *                       Flash, and so on. There are two possible cases as shown below:
 *                       -  0: this area is protected.
 *                       -  1: this area is unprotected.
 * @return Successful completion (FTFx_OK )
 * @return Error value (FTFx_ERR_CHANGEPROT)
 */
flash_drv_status_t PFlashSetProtection(uint32_t  protectStatus);

/*!
 * @brief Flash get security state.
 *
 * This API retrieves the current Flash security status, including
 * the security enabling state and the back door key enabling state.
 *
 * @param securityState: To return the current security status code.
 *                       FLASH_NOT_SECURE (0x01): Flash currently not in secure state
 *                       FLASH_SECURE_BACKDOOR_ENABLED (0x02): Flash is secured and
 *                       back door key access enabled
 *                       FLASH_SECURE_BACKDOOR_DISABLED (0x04): Flash is secured and
 *                       back door key access disabled.
 * @return
 */
void FlashGetSecurityState(uint8_t* securityState);

/*!
 * @brief Flash security bypass.
 *
 * This API un-secures the device by comparing the user's provided back
 * door key with the ones in  the Flash Configuration Field.  If  they are
 * matched,  the  security is  released. Otherwise, an
 * error code is returned.
 *
 * @param pSSDConfig:    The SSD configuration structure pointer.
 * @param keyBuffer:     Point to the user buffer containing the back door key.
 * @param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * @return Successful completion (FTFx_OK)
 * @return Error value  (FTFx_ERR_ACCERR)
 */
flash_drv_status_t FlashSecurityBypass(const PFLASH_SSD_CONFIG pSSDConfig, \
                                  const uint8_t* keyBuffer, \
                                  pFLASHCOMMANDSEQUENCE pFlashCommandSequence);
/*!
 * @brief Flash erase all Blocks.
 *
 * This API  erases all Flash memory,  initializes  the FlexRAM, verifies
 * all memory contents, and then releases the MCU security.
 *
 * @param pSSDConfig:    The SSD configuration structure pointer.
 * @param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * @return Successful completion (FTFx_OK)
 * @return Error value  (FTFx_ERR_PVIOL, FTFx_ERR_MGSTAT0, FTFx_ERR_ACCERR)
 */
flash_drv_status_t FlashEraseAllBlock(const PFLASH_SSD_CONFIG pSSDConfig, \
                                      pFLASHCOMMANDSEQUENCE pFlashCommandSequence);

/*!
 * @brief Flash verify all Blocks.
 *
 * This function checks to see if the P-Flash and/or D-Flash, EEPROM
 * backup area, and D-Flash IFR have been erased to the specified read
 * margin level, if applicable, and releases security if the readout passes.
 *
 * @param pSSDConfig:    The SSD configuration structure pointer.
 * @param marginLevel:   Read Margin Choice as follows:
 *                       marginLevel = 0x0: use the Normal read level
 *                       marginLevel = 0x1: use the User read
 *                       marginLevel = 0x2: use the Factory read
 * @param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * @return Successful completion (FTFx_OK)
 * @return Error value  (FTFx_ERR_MGSTAT0, FTFx_ERR_ACCERR)
 */
flash_drv_status_t FlashVerifyAllBlock(const PFLASH_SSD_CONFIG pSSDConfig, \
                                  uint8_t marginLevel, \
                                  pFLASHCOMMANDSEQUENCE pFlashCommandSequence);

/*!
 * @brief Flash erase sector.
 *
 * This API erases one or more sectors in P-Flash or  D-Flash memory.
 * This  API  always  returns  FTFx_OK  if  size  provided  by  the user  is
 * zero  regardless  of  the  input validation.
 *
 * @param pSSDConfig:    The SSD configuration structure pointer.
 * @param dest:          Address in the first sector to be erased.
 * @param size:          Size to be erased in bytes. It is used to determine
 *                       number of sectors to be erased.
 * @param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * @return Successful completion (FTFx_OK)
 * @return Error value  (FTFx_ERR_MGSTAT0, FTFx_ERR_ACCERR, FTFx_ERR_PVIOL,FTFx_ERR_SIZE)
 */
flash_drv_status_t FlashEraseSector(const PFLASH_SSD_CONFIG pSSDConfig, \
                               uint32_t dest, \
                               uint32_t size, \
                               pFLASHCOMMANDSEQUENCE pFlashCommandSequence);

/*!
 * @brief Flash verify section.
 *
 * This API  checks  if a section of the P-Flash or the D-Flash memory
 * is erased  to  the specified read margin level.
 *
 * @param pSSDConfig:    The SSD configuration structure pointer.
 * @param dest:          Start address for the intended verify operation.
 * @param number:        Number of alignment unit to be verified. Refer to
 *                       corresponding reference manual to get correct
 *                       information of alignment constrain.
 * @param marginLevel:   Read Margin Choice as follows:
 *                       marginLevel = 0x0: use Normal read level
 *                       marginLevel = 0x1: use the User read
 *                       marginLevel = 0x2: use the Factory read
 * @param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * @return Successful completion (FTFx_OK)
 * @return Error value  (FTFx_ERR_MGSTAT0, FTFx_ERR_ACCERR)
 */
flash_drv_status_t FlashVerifySection(const PFLASH_SSD_CONFIG pSSDConfig, \
                                 uint32_t dest, \
                                 uint16_t number, \
                                 uint8_t marginLevel, \
                                 pFLASHCOMMANDSEQUENCE pFlashCommandSequence);
/*!
 * @brief Flash erase suspend.
 *
 * This API is used to suspend a current operation of Flash erase sector command.
 * This function must be located in RAM memory or different Flash blocks which are
 * targeted for writing to avoid the RWW error.
 *
 * @param
 * @return
 */
void FlashEraseSuspend(void);
/*!
 * @brief Flash erase resume.
 *
 * This API is used to resume a previous suspended operation of Flash erase sector command
 * This function must be located in RAM memory or different Flash blocks which are targeted
 * for writing to avoid RWW error.
 *
 * @param
 * @return
 */
void FlashEraseResume(void);
/*!
 * @brief Flash read once.
 *
 * This API is used to read out a reserved 64 byte field located in the P-Flash IFR via given number
 * of record. See the corresponding reference manual to get the correct value of this number.
 *
 * @param pSSDConfig:    The SSD configuration structure pointer.
 * @param recordIndex:   The record index will be read. It can be from 0x0
 *                       to 0x7 or from 0x0 to 0xF according to specific derivative.
 * @param pDataArray:    Pointer to the array to return the data read by the read once command.
 * @param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * @return Successful completion (FTFx_OK)
 * @return Error value  (FTFx_ERR_ACCERR)
 */
flash_drv_status_t FlashReadOnce(const PFLASH_SSD_CONFIG pSSDConfig, \
                            uint8_t recordIndex,\
                            uint8_t* pDataArray, \
                            pFLASHCOMMANDSEQUENCE pFlashCommandSequence);
/*!
 * @brief Flash program once.
 *
 * This API  is  used  to  program  to  a  reserved  64  byte  field  located  in  the
 * P-Flash  IFR  via  given number of record. See the corresponding reference manual
 * to get correct value of this number.
 *
 * @param pSSDConfig:    The SSD configuration structure pointer.
 * @param recordIndex:   The record index will be read. It can be from 0x0
 *                       to 0x7 or from 0x0 to 0xF according to specific derivative.
 * @param pDataArray:    Pointer to the array from which data will be
 *                       taken for program once command.
 * @param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * @return Successful completion (FTFx_OK)
 * @return Error value  (FTFx_ERR_ACCERR,FTFx_ERR_MGSTAT0)
 */
flash_drv_status_t FlashProgramOnce(const PFLASH_SSD_CONFIG pSSDConfig, \
                               uint8_t recordIndex,\
                               const uint8_t* pDataArray, \
                               pFLASHCOMMANDSEQUENCE pFlashCommandSequence);
/*!
 * @brief Flash read resource.
 *
 * This API is used to read data from special purpose memory in Flash memory module
 * including P-Flash IFR, swap IFR, D-Flash IFR space and version ID.
 *
 * @param pSSDConfig:    The SSD configuration structure pointer.
 * @param dest:          Start address for the intended read operation.
 * @param pDataArray:    Pointer to the data returned by the read resource command.
 * @param resourceSelectCode:    Read resource select code:
 *                               0 : Flash IFR
 *                               1: Version ID
 * @param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * @return Successful completion (FTFx_OK)
 * @return Error value  (FTFx_ERR_ACCERR)
 */
flash_drv_status_t FlashReadResource(const PFLASH_SSD_CONFIG pSSDConfig, \
                                uint32_t dest, \
                                uint8_t* pDataArray, \
                                uint8_t  resourceSelectCode, \
                                pFLASHCOMMANDSEQUENCE pFlashCommandSequence);
/*!
 * @brief Flash program
 *
 * This  API  is  used  to  program  4  consecutive  bytes  (for  program  long
 * word  command)  and  8 consecutive bytes (for program phrase command) on
 * P-Flash or D-Flash block. This  API  always  returns  FTFx_OK  if  size
 * provided  by  user  is  zero  regardless  of  the  input validation
 *
 * @param pSSDConfig:    The SSD configuration structure pointer.
 * @param dest:          Start address for the intended program operation.
 * @param size:          Size in byte to be programmed
 * @param pData:         Pointer of source address from which data has to
 *                       be taken for program operation.
 * @param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * @return Successful completion (FTFx_OK)
 * @return Error value  (FTFx_ERR_ACCERR, FTFx_ERR_PVIOL, FTFx_ERR_SIZE, FTFx_ERR_MGSTAT0)
 */
flash_drv_status_t FlashProgram(const PFLASH_SSD_CONFIG pSSDConfig, \
                                   uint32_t dest, \
                                   uint32_t size, \
                                   uint8_t* pData, \
                                   pFLASHCOMMANDSEQUENCE pFlashCommandSequence);
/*!
 * @brief Flash program check
 *
 * This API tests a previously programmed P-Flash or D-Flash long word
 * to see if it reads correctly at the specified margin level. This
 * API always returns FTFx_OK if size provided by user is zero
 * regardless  of  the  input validation
 *
 * @param pSSDConfig:    The SSD configuration structure pointer.
 * @param dest:          Start address for the intended program check operation.
 * @param size:          Size in byte to check accuracy of program operation
 * @param pExpectedData: The pointer to the expected data.
 * @param pFailAddr:     Returned the first aligned failing address.
 * @param marginLevel:   Read margin choice as follows:
 *                       marginLevel = 0x1: read at User margin 1/0 level.
 *                       marginLevel = 0x2: read at Factory margin 1/0 level.
 * @param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * @return Successful completion (FTFx_OK)
 * @return Error value  (FTFx_ERR_ACCERR, FTFx_ERR_MGSTAT0)
 */
flash_drv_status_t FlashProgramCheck(const PFLASH_SSD_CONFIG pSSDConfig, \
                                uint32_t  dest, \
                                uint32_t  size, \
                                uint8_t*  pExpectedData, \
                                uint32_t* pFailAddr, \
                                uint8_t   marginLevel, \
                                pFLASHCOMMANDSEQUENCE pFlashCommandSequence);
/*!
 * @brief Calculates check sum.
 *
 * This API  performs 32 bit sum of each byte data over a specified Flash
 * memory range without carry which provides rapid method for checking data integrity.
 * The  callback  time  period  of  this  API  is  determined  via  FLASH_CALLBACK_CS  macro  in the
 * SSD_FTFx_Common.h  which is used as a counter value for the CallBack() function calling in
 * this API. This value can be changed as per  the user  requirement. User can change  this value  to
 * obtain the maximum permissible callback time period.
 * This  API  always  returns  FTFx_OK  if  size  provided  by  user  is  zero  regardless  of  the  input
 * validation.
 *
 * @param pSSDConfig:    The SSD configuration structure pointer.
 * @param dest:          Start address of the Flash range to be summed
 * @param size:          Size in byte of the Flash range to be summed
 * @param pSum:          To return the sum value
 * @return Successful completion (FTFx_OK)
 * @return Error value  (FTFx_ERR_RANGE)
 */
flash_drv_status_t FlashCheckSum(const PFLASH_SSD_CONFIG pSSDConfig, \
                            uint32_t dest, \
                            uint32_t size, \
                            uint32_t* pSum);

