arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/inc/fsl_flash_driver_c90tfs.h
#if FSL_FEATURE_FLASH_HAS_PROGRAM_SECTION_CMD
/*!
 * @brief Flash program section
 *
 * This API will program the data found in the Section Program Buffer
 * to previously erased locations in the Flash memory. Data is preloaded into
 * the Section Program Buffer by writing to the acceleration Ram and FlexRam
 * while it is set to function as a RAM. The Section Program Buffer is limited
 * to  the  value of FlexRam divides by a ratio. Refer to the associate reference
 * manual to get correct value of this ratio.
 * For derivatives including swap feature, the swap indicator address is encountered
 * during FlashProgramSection, it is bypassed without setting FPVIOL but the content
 * are not be programmed. In addition, the content of source data used to program to
 * swap indicator will be re-initialized to 0xFF after completion of this command.
 *
 * @param pSSDConfig:    The SSD configuration structure pointer.
 * @param dest:          Start address for the intended program operation.
 * @param number:          Number of alignment unit to be programmed. Refer to associate
 *                       reference manual to get correct value of this alignment constrain.
 * @param pFlashCommandSequence :  Pointer to the Flash command sequence function.
 * @return Successful completion (FTFx_OK)
 * @return Error value  (FTFx_ERR_ACCERR, FTFx_ERR_PVIOL, FTFx_ERR_MGSTAT0, FTFx_ERR_RAMRDY)
 */
flash_drv_status_t FlashProgramSection(const PFLASH_SSD_CONFIG pSSDConfig, \
                                  uint32_t dest, \
                                  uint16_t number, \
                                  pFLASHCOMMANDSEQUENCE pFlashCommandSequence);
#endif

#if FSL_FEATURE_FLASH_HAS_ERASE_FLASH_BLOCK_CMD
/*!
 * @brief Flash erase block
 *
 * This API  erases all addresses in an individual P-Flash or D-Flash block.
 * For  the derivatives  including multiply  logical P-Flash or D-Flash blocks,
 * this API   erases a single block in a single call.
 *
 * @param pSSDConfig:    The SSD configuration structure pointer.
 * @param dest:          Start address for the intended erase operation.
 * @param pFlashCommandSequence :  Pointer to the Flash command sequence function.
 * @return Successful completion (FTFx_OK)
 * @return Error value  (FTFx_ERR_ACCERR, FTFx_ERR_PVIOL, FTFx_ERR_MGSTAT0)
 */
flash_drv_status_t FlashEraseBlock(const PFLASH_SSD_CONFIG pSSDConfig, \
                                   uint32_t dest, \
                                   pFLASHCOMMANDSEQUENCE pFlashCommandSequence);
/*!
 * @brief Flash verify block
 *
 * This API  checks to see  if an entire P-Flash or D-Flash block has been
 * erased to the specified margin level
 * For  the derivatives  including multiply  logical P-Flash or D-Flash blocks,
 * this API   erases a single block in a single call.
 *
 * @param pSSDConfig:    The SSD configuration structure pointer.
 * @param dest:          Start address for the intended verify operation.
 * @param marginLevel:   Read Margin Choice as follows:
 *                       marginLevel = 0x0: use Normal read level
 *                       marginLevel = 0x1: use the User read
 *                       marginLevel = 0x2: use the Factory read
 * @param pFlashCommandSequence :  Pointer to the Flash command sequence function.
 * @return Successful completion (FTFx_OK)
 * @return Error value  (FTFx_ERR_ACCERR, FTFx_ERR_MGSTAT0)
 */
flash_drv_status_t FlashVerifyBlock(const PFLASH_SSD_CONFIG pSSDConfig, \
                               uint32_t dest, \
                               uint8_t marginLevel, \
                               pFLASHCOMMANDSEQUENCE pFlashCommandSequence);
#endif

#if FSL_FEATURE_FLASH_HAS_FLEX_NVM
/*!
 * @brief EERAM get protection
 *
 * This  API  retrieves  which  EEPROM  sections  of  FlexRAM  are  protected
 * against  program  and erase operations. Considering  the  time consumption
 * for getting protection is very low and even can be ignored, it is not necessary
 * to utilize the Callback function to support the time-critical events
 *
 * @param protectStatus: To return the current value of the EEPROM
 *                       Protection Register. Each bit is corresponding to
 *                       protection status of 1/8 of the total EEPROM
 *                       use. The least significant bit is corresponding to
 *                       the lowest address area of EEPROM. The most
 *                       significant bit is corresponding to the highest
 *                       address area of EEPROM and so on. There are
 *                       two possible cases as below:
 *                       -  0: this area is protected.
 *                       -  1: this area is unprotected.
 * @return Successful completion (FTFx_OK)
 * @return Error value  (FTFx_ERR_NOEEE)
 */
flash_drv_status_t EERAMGetProtection(uint8_t*  protectStatus);
/*!
 * @brief EERAM set protection
 *
 * This API sets protection to the intended protection status for EEPROM us
 * area of FlexRam. This is subject to a protection transition restriction.
 * If there is a setting violation, it returns failed information and
 * the current protection status won’t be changed.
 *
 * @param protectStatus: The intended protection status value should be
 *                       written to the EEPROM Protection Register.
 *                       Each bit is corresponding to
 *                       protection status of 1/8 of the total EEPROM
 *                       use. The least significant bit is corresponding to
 *                       the lowest address area of EEPROM. The most
 *                       significant bit is corresponding to the highest
 *                       address area of EEPROM and so on. There are
 *                       two possible cases as below:
 *                       -  0: this area is protected.
 *                       -  1: this area is unprotected.
 * @return Successful completion (FTFx_OK)
 * @return Error value  (FTFx_ERR_NOEEE,FTFx_ERR_CHANGEPROT)
 */
flash_drv_status_t EERAMSetProtection(uint8_t  protectStatus);
/*!
 * @brief Flash Set EEEEnable
 *
 * This function is used to change the function of the FlexRAM. When not
 * partitioned for EEPROM backup, the FlexRam is typically used as traditional
 * RAM. Otherwise, the FlexRam is typically used to store EEPROM data and user
 * can use this API to change its functionality according to his application requirement.
 * For example, after partitioning to have EEPROM backup, FlexRAM  is used  for EEPROM
 * use accordingly. And this API is used to set FlexRAM is available for
 * traditional RAM for FlashProgramSection() use.
 *
 * @param pSSDConfig:               The SSD configuration structure pointer.
 * @param EEEEnable:                FlexRam function control code. It can be:
 *                                  -  0xFF: make FlexRam available for RAM.
 *                                  -  0x00: make FlexRam available for EEPROM.
 * @param pFlashCommandSequence:    Pointer to the Flash command sequence function.
 * @return Successful completion (FTFx_OK)
 * @return Error value  (FTFx_ERR_ACCERR)
 */
flash_drv_status_t SetEEEEnable(const PFLASH_SSD_CONFIG pSSDConfig, \
                           uint8_t EEEEnable,pFLASHCOMMANDSEQUENCE pFlashCommandSequence);
/*!
 * @brief EEPROM Emulator Write
 *
 * This API is used to write data to FlexRAM section which is  partitioned
 * as EEPROM use for EEPROM operation. After data has been written to EEPROM
 * use section of FlexRAM, the EEPROM file system will create new data record
 * in EEPROM back-up area of FlexNVM in round-robin fashion.
 * There  is no alignment constraint for destination and size parameters
 * provided by user. However, according to user’s input provided, this
 * API will set priority to write to FlexRAM with following rules:
 * 32-bit writing is invoked if destination is 32 bit aligned and size
 * is not  less than 32 bits.
 * 16-bit writing is  invoked if destination is 16 bit aligned and size
 * is not  less than 16 bits.
 * 8-bit writing is invoked if destination is 8 bit aligned and size is not less than 8 bits.
 *
 * @param pSSDConfig:    The SSD configuration structure pointer.
 * @param dest:          Start address for the intended write operation.
 * @param size:          Size in byte to be written.
 * @param pData:         Pointer to source address from which data
 *                       has to be taken for writing operation.
 * @return Successful completion (FTFx_OK)
 * @return Error value  (FTFx_ERR_RANGE, FTFx_ERR_NOEEE, FTFx_ERR_PVIOL)
 */
flash_drv_status_t EEEWrite(const PFLASH_SSD_CONFIG pSSDConfig, uint32_t dest, uint32_t size, uint8_t* pData);
/*!
 * @brief Flash D/E-Flash Partition.
 *
 * This API prepares the FlexNVM block for use as D-Flash, EEPROM backup, or a combination
 * of both and initializes the FlexRAM.
 *
 * The single partition choice should be used through entire life time of a given
 * application to guarantee the Flash endurance and data retention of Flash module.
 *
 * @param   pSSDConfig                The SSD configuration structure pointer
 * @param   EEEDataSizeCode           EEPROM Data Size Code
 * @param   DEPartitionCode           FlexNVM Partition Code
 * @param   pFlashCommandSequence     Pointer to the Flash command sequence function.
 *
 * @return  Successful completion(FTFx_OK)
 * @return  Error value(FTFx_ERR_ACCERR, FTFx_ERR_MGSTAT0)
 */
flash_drv_status_t DEFlashPartition(const PFLASH_SSD_CONFIG pSSDConfig, \
                               uint8_t EEEDataSizeCode, \
                               uint8_t DEPartitionCode, \
                               pFLASHCOMMANDSEQUENCE pFlashCommandSequence);
/*!
 * @brief D-Flash get protection.
 *
 * This API retrieves current P-Flash protection status. Considering the time consumption
 * for getting protection is very low and even can be ignored, it is not necessary to utilize
 * the Callback function to support the time-critical events.
 *
 * @param   pSSDConfig                The SSD configuration structure pointer
 * @param   protectStatus             To return the current value of the D-Flash Protection
 *                                    Register. Each bit is corresponding to protection status
 *                                    of 1/8 of the total D-Flash. The least significant bit is
 *                                    corresponding to the lowest address area of D-Flash. The
 *                                    most significant bit is corresponding to the highest address
 *                                    area of D-Flash and so on. There are two possible cases as below:
 *                                    - 0 : this area is protected.
 *                                    - 1 : this area is unprotected.
 *
 * @return  Successful completion(FTFx_OK)
 * @return  Error value(FTFx_ERR_EFLASHONLY)
 */
flash_drv_status_t DFlashGetProtection(const PFLASH_SSD_CONFIG pSSDConfig, uint8_t*  protectStatus);
/*!
 * @brief D-Flash set protection.
 *
 * This API sets the D-Flash protection to the intended protection status. Setting D-Flash
 * protection status is subject to a protection transition restriction. If there is a setting
 * violation, it returns failed information and the current protection status won’t be changed.
 *
 * @param   pSSDConfig                The SSD configuration structure pointer
 * @param   protectStatus             The expected protect status user wants to set to D-Flash Protection
 *                                    Register. Each bit is corresponding to protection status
 *                                    of 1/8 of the total D-Flash. The least significant bit is
 *                                    corresponding to the lowest address area of D-Flash. The
 *                                    most significant bit is corresponding to the highest address
 *                                    area of D-Flash and so on. There are two possible cases as below:
 *                                    - 0 : this area is protected.
 *                                    - 1 : this area is unprotected.
 *
 * @return  Successful completion(FTFx_OK)
 * @return  Error value(FTFx_ERR_EFLASHONLY,FTFx_ERR_CHANGEPROT)
 */
flash_drv_status_t DFlashSetProtection(const PFLASH_SSD_CONFIG pSSDConfig, uint8_t  protectStatus);
#endif /* End of FSL_FEATURE_FLASH_HAS_FLEX_NVM */

#ifdef FSL_FEATURE_FLASH_HAS_PFLASH_BLOCK_SWAP
/*!
 * @brief  Swaps between the two halves of the total logical P-Flash memory blocks in the memory map.
 *
 * The swap API provides to user with an ability to interfere in a swap progress by letting the
 * user code know about the swap state in each phase of the process. This is done via pSwapCallBack()
 * parameter. To stop at each intermediate swap state,  set the return value of
 * this callback function to FALSE. To complete swap process within a single call,
 * set the return value of this function to TRUE.
 *
 * Erase the non-active swap indicator  somewhere in the
 * application code or  in the swap call back function when swap system is in UPDATE state.
 *
 * In addition, if user does not want to use the swap call back parameter,  pass the NULL_SWAP_CALLBACK
 * as a null pointer. In this situation, the PFlashSwap()  behaves in the same way as  setting the return
 * value of pSwapCallBack to TRUE and the user does not need to erase the non-active swap
 * indicator when the swap system is in UPDATE state.
 *
 * Below is an example to show how to implement a swap callback:
 * @code
 * bool PFlashSwapCallback(uint8_t currentSwapMode)
 * {
 *     switch (currentSwapMode)
 *     {
 *     case FTFx_SWAP_UNINI:
 *         Put your application-specific code here
 *         break;
 *     case FTFx_SWAP_READY:
 *         Put your application-specific code here
 *         break;
 *     case FTFx_SWAP_UPDATE:
 *         Put your application-specific code here (example: erase non-active swap indicator here)
 *         break;
 *     case FTFx_SWAP_UPDATE_ERASED:
 *         Put your application-specific code here (example: erase non-active swap indicator here)
 *         break;
 *     case FTFx_SWAP_COMPLETE:
 *         Put your application-specific code here
 *         break;
 *     default:
 *         break;
 *    }
 *        return TRUE;  Return FALSE to stop at intermediate swap state
 *}
 * @endcode
 * The swap indicator provided by the user must be within the lower half of P-Flash block but not in the
 * Flash configuration area. If P-Flash block has two logical blocks, the swap indicator must be
 * in P-Flash block 0. If the P-Flash block has four logical blocks, the swap indicator can be in block
 * 0 or block 1. It must not be in the Flash configuration field.
 * The user must use the same swap indicator for all swap control code except report swap status once
 * swap system has been initialized. To refresh swap system to un-initialization state,
 * use the FlashEraseAllBlock() to clean up the swap environment.
 *
 * @param   pSSDConfig                The SSD configuration structure pointer
 * @param   addr                      Address of swap indicator.
 * @param   pSwapCallback             Callback to do specific task while the swapping is being performed
 * @param   pFlashCommandSequence     Pointer to the Flash command sequence function.
 *
 * @return  Successful completion(FTFx_OK)
 * @return  Error value(FTFx_ERR_ACCERR,FTFx_ERR_MGSTAT0)
 */
flash_drv_status_t PFlashSwap(const PFLASH_SSD_CONFIG pSSDConfig, \
                  uint32_t addr, \
                  PFLASH_SWAP_CALLBACK pSwapCallback, \
                  pFLASHCOMMANDSEQUENCE pFlashCommandSequence);
/*!
 * @brief  Implements swap control command corresponding with the swap control code provided via the swapcmd parameter.
 *
 * @param   pSSDConfig                The SSD configuration structure pointer
 * @param   addr                      Address of swap indicator.
 * @param   swapcmd                   Swap Control Code:
 *                                      0x01 - Initialize Swap System
 *                                      0x02 - Set Swap in Update State
 *                                      0x04 - Set Swap in Complete Stat
 *                                      0x08 - Report Swap Status
 * @param   pCurrentSwapMode          Current Swap Mode:
 *                                      0x00 - Uninitialized
 *                                      0x01 - Ready
 *                                      0x02 - Update
 *                                      0x03 - Update-Erased
 *                                      0x04 - Complete
 * @param   pCurrentSwapBlockStatus   Current Swap Block Status indicates which program Flash block
 *                                    is currently located at relative Flash address 0x0_0000
 *                                      0x00 - Program Flash block 0
 *                                      0x01 - Program Flash block 1
 * @param   pNextSwapBlockStatus      Next Swap Block Status indicates which program Flash block
 *                                    is located at relative Flash address 0x0_0000 after the next reset.
 *                                      0x00 - Program Flash block 0
 *                                      0x01 - Program Flash block 1
 * @param   pFlashCommandSequence     Pointer to the Flash command sequence function.
 *
 * @return  Successful completion(FTFx_OK)
 * @return  Error value(FTFx_ERR_ACCERR,FTFx_ERR_MGSTAT0)
 */
flash_drv_status_t PFlashSwapCtl(const PFLASH_SSD_CONFIG pSSDConfig, \
                             uint32_t addr, \
                             uint8_t swapcmd, \
                             uint8_t* pCurrentSwapMode,\
                             uint8_t* pCurrentSwapBlockStatus, \
                             uint8_t* pNextSwapBlockStatus, \
                             pFLASHCOMMANDSEQUENCE pFlashCommandSequence);
#endif /* End of FSL_FEATURE_FLASH_HAS_PFLASH_BLOCK_SWAP */
#if FSL_FEATURE_FLASH_HAS_ERASE_ALL_BLOCKS_UNSECURE_CMD
/*!
 * @brief Flash erase all Blocks unsecure.
 *
 * This API  erases all Flash memory,  initializes  the FlexRAM, verifies
 * all memory contents, and then releases the MCU security.
 *
 * @param pSSDConfig:    The SSD configuration structure pointer.
 * @param pFlashCommandSequence :     Pointer to the Flash command sequence function.
 * @return Successful completion (FTFx_OK)
 * @return Error value  (FTFx_ERR_PVIOL, FTFx_ERR_MGSTAT0, FTFx_ERR_ACCERR)
 */
flash_drv_status_t FlashEraseAllBlockUnsecure (const PFLASH_SSD_CONFIG pSSDConfig, \
                       pFLASHCOMMANDSEQUENCE pFlashCommandSequence);
#endif

#if defined(__cplusplus)
}
#endif

/*@}*/ /* End of C90TFS Flash driver APIs*/
/*! @}*/ /* End of addtogroup c90tfs_flash_driver */

#endif  /* FSL_FLASH_DRIVER_C90TFS_H_ */
